<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>Kelirikkopalvelun ohje</title>

</head>
<body>
  <h1>K&auml;ytt&ouml;liittym&auml;n osat</h1>
  <img alt="karttakuva" src="images/KelirikkoApp4.png">

  <ol>
	<li>Sivun yl&auml;osassa on <strong>otsikkorivi</strong>, jossa on otsikon lis&auml;ksi tilaa tulosta ja ohje toimintopainikkeille.
	<li>Vasemman laidan ensimm&auml;isess&auml; panelissa on kartalla n&auml;ytett&auml;vien painorajoitusten <strong>selite eli legenda</strong>, josta k&auml;ytt&auml;j&auml; voi kytke&auml; haluamansa painorajoitukset kartalle(/lta). Toisessa panelissa on kartalla n&auml;kyvien painorajoitusten tietoja. Kolmas paneli on varattu linkeille.
	<li><strong>Karttakuva</strong> koostuu taustakarttapalvelun rasterikarttatasoista, jotka vaihtuvat mittakaavan mukaan. Lis&auml;ksi karttakuvalla esitet&auml;&auml;n painorajoitukset k&auml;ytt&auml;n valintojen perusteella.
	<li>Oikeassa alakulmassa on <strong>yleissilm&auml;yskartta</strong>, jota klikkaamalla kartta kohdistuu klikattuun kohtaan.	
	<li>Vasemmassa yl&auml;kulmassa on mittakaavan <strong>liukuvalitsin</strong>, josta karttaa voidaan l&auml;hent&auml;&auml; ja loitontaa.
	
  </ol>
  <h2>Navigointi</h2>
  <ul>
    <li><strong>Siirr&auml;</strong> karttaa raahaamalla sit&auml; hiirell&auml;, vasen nappi pohjassa. 
    <li><strong>L&auml;henn&auml;</strong> kaksoisklikkaamalla tai vasemman yl&auml;reunan liukuvalitsinta siirt&auml;m&auml;ll&auml; tai rullahiirell&auml;.
    <li><strong>L&auml;henn&auml; alueeseen</strong> rajaamalla alue kartalta shift-painike pohjassa. 
    <li><strong>Loitonna</strong> vasemman yl&auml;reunan liukuvalitsinta siirt&auml;m&auml;ll&auml;, tai rullahiirell&auml;.
    <li><strong>Loitonna alueeksi</strong> rajaamalla alue kartalta ctrl- ja shift-painikkeet pohjassa. 
    <li><strong>Kohdista</strong> kartta toiselle puolen Suomea klikkaamalla oikean alareunan yleissilm&auml;yskarttaa.
  </ul>
  
  <h2>Otsikkorivi</h2>
  Otsikkorivill&auml; on seuraava rakenne:
  <ul>
    
	<li><strong>"Tulosta"</strong>-painikkeella p&auml;&auml;see tulostusn&auml;kym&auml;&auml;n. Tulostus tapahtuu selaimen omalla tulostustoiminnolla tulostusn&auml;kym&auml;st&auml;.
	<li><strong>"Exceliin siirto"</strong> Tulostus n&auml;kym&auml;ss&auml; olevan taulukon voi maalata, kopioida(ctrl + c) ja liitt&auml;&auml;(ctrl + v) exceliin. Maalaaminen kannattaa tehd&auml; aloittamalla taulukon yl&auml;puolisesta legendasta, jotta koko taulukko varmasti tulee kopioitua.
	<li><strong>"Ohje"</strong>-painike avaa k&auml;ytt&ouml;liittym&auml;n ohjeen.
	
  </ul>
  <h2>Vasemman laidan panelit</h2>
  Vasemman laidan panelit aktivoidaan klikkaamalla hiirell&auml; haluttua panelia.
  <ul>
    
	<li><strong>"Painorajoitukset kartalla"</strong>-panelissa on kolme eri painorajoituksiin kohdituvaa valintaa, jotka voi asettaa valintaruudusta p&auml;&auml;lle/pois. Aktiivisen panelin otsikko n&auml;kyy alleviivattuna ja hieman tummemmalla otsikonv&auml;rill&auml;. Lis&auml;ksi voimassa olleita painorajoituksia voi katsella eri vuosilta valitsemalla alasvetolaatikosta vuosi. "Painorajoitukset kartalla"- panelissa on kerrottu kuinka n&auml;kyv&auml;n kartta-alueen kohteiden lukum&auml;&auml;r&auml; ja yhteenlaskettu pituus. 
	<li><strong>"Painorajoitukset listana"</strong>-paneli.<br>
	<img alt="painorajoitukset" src="images/KelirikkoApp_PI.png"><br>
	Panelin sis&auml;lt&auml;m&auml;st&auml; taulukosta voi siirty&auml; kartalle tuplaklikkaamalla taulukon rivi&auml;, jolloin karttakuva siirtyy kohteeseen. Kohdetta klikkaamalla avautuu ominaisuustietoikkuna. Ominaisuustieto- eli infoikkunan toiminnolla korosta taas voi siirty&auml; "Painorajoitukset listana"- paneelin taulukkoon, josta lis&auml;&auml; infoikkunan toiminnallisuudessa. 
	<li><strong>"Lis&auml;tietolinkit"</strong>-paneli sis&auml;lt&auml;&auml; linkkej&auml;.<br>
	<img alt="linkit" src="images/kelirikko2.png"><br>
  </ul>  
    
	<b>Infoikkunan toiminnallisuus</b><br>
	Infoikkuna avautuu n&auml;kym&auml;&auml;n klikattaessa kohdetta hiiren vasemmalla n&auml;pp&auml;imell&auml;. Mik&auml;li klikatussa kohdassa on useampia kohteita, ne luetaan allekkain taulukkoon. Painorajoitukset jaetaan myös eri v&auml;lilehdille jaoteltuna seuraavasti:
	<ul>
	<li>Uhanalaiset
	<li>Voimassa olevat
	<li>Voimassa olleet
	</ul>
	Ominaisuustiedoissa on korosta linkki, jota klikkaamalla kohde korostuu ja vasemmanpuolen "Painorajoitukset listana"- panelin taulukon vastaava rivi korostuu. Toisen kerran korosta linkki&auml; klikattaessa kohteen korostus kartalla h&auml;vi&auml;&auml; tai kun infoikkuna suljetaan.
    
	<br>
	
  </ul>
</body>
</html>